In [1]:
# pandas module 설치
!pip install pandas

Requirement already satisfied: pandas in c:\developer\python39\lib\site-packages (1.3.0)
Requirement already satisfied: numpy>=1.17.3 in c:\developer\python39\lib\site-packages (from pandas) (1.21.0)
Requirement already satisfied: pytz>=2017.3 in c:\developer\python39\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\developer\python39\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\developer\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

WARNING: You are using pip version 21.1.3; however, version 21.2.1 is available.
You should consider upgrading via the 'c:\developer\python39\python.exe -m pip install --upgrade pip' command.

In [6]:
# 실습
import pandas as pd
s = pd.Series([1, 9, -3, 4])
#print(s)

#print(s.values) #값 확인
#print(s.index) # 인덱스 확인
print(s.dtypes) # 자료형 확인

int64

In [7]:
# 인덱스 지정
s = pd.Series([1, 9, -3, 4], index=['a', 'b', 'c', 'd'])
print(s)

a    1
b    9
c   -3
d    4
dtype: int64

In [8]:
# 사전과 호환
dic = {'A':3000, 'B':6000, 'C':2000, 'D':4000}
s = pd.Series(dic)
print(s)

A    3000
B    6000
C    2000
D    4000
dtype: int64

In [9]:
df = pd.DataFrame({'A':1., 
                  'B':'2021-05-06',
                   'C':[1,2,3,4],
                   'D':(5,6,7,8),
                   'E':0,
                   'F':'Web'
                  })
print(df)

     A           B  C  D  E    F
0  1.0  2021-05-06  1  5  0  Web
1  1.0  2021-05-06  2  6  0  Web
2  1.0  2021-05-06  3  7  0  Web
3  1.0  2021-05-06  4  8  0  Web

In [11]:
# 인덱스 확인
# 행 
print(df.index)
# 열
print(df.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [12]:
data = {'name':['A', 'B', 'C', 'D', 'E'],
       'year':[2017, 2018, 2019, 2020, 2021],
       'points':[3.5, 4.2, 2.6, 7.4, 1.9]}
df = pd.DataFrame(data)
print(df)

  name  year  points
0    A  2017     3.5
1    B  2018     4.2
2    C  2019     2.6
3    D  2020     7.4
4    E  2021     1.9

In [13]:
# 인덱싱[열] 열을 기준으로 데이터 추가 삭제 및 변경 가능
print(df[['year']])

   year
0  2017
1  2018
2  2019
3  2020
4  2021

In [14]:
print(df[['year', 'points']])

   year  points
0  2017     3.5
1  2018     4.2
2  2019     2.6
3  2020     7.4
4  2021     1.9

In [15]:
# 새로운 열 추가
df['new'] = [1,2,3,4,5]
print(df)

  name  year  points  new
0    A  2017     3.5    1
1    B  2018     4.2    2
2    C  2019     2.6    3
3    D  2020     7.4    4
4    E  2021     1.9    5

In [16]:
# 조건을 사용하여 새로운 열 추가
df['past'] = df['year'] < 2020
print(df)

  name  year  points  new   past
0    A  2017     3.5    1   True
1    B  2018     4.2    2   True
2    C  2019     2.6    3   True
3    D  2020     7.4    4  False
4    E  2021     1.9    5  False

In [17]:
# 삭제
del df['past']
print(df)

  name  year  points  new
0    A  2017     3.5    1
1    B  2018     4.2    2
2    C  2019     2.6    3
3    D  2020     7.4    4
4    E  2021     1.9    5

In [18]:
# 인덱싱[행] 행을 기준으로 데이터 추가 및 삭제
data = {'name':['A', 'B', 'C', 'D', 'E'],
       'year':[2017, 2018, 2019, 2020, 2021],
       'points':[3.5, 4.2, 2.6, 7.4, 1.9]}
df = pd.DataFrame(data)
print(df)

  name  year  points
0    A  2017     3.5
1    B  2018     4.2
2    C  2019     2.6
3    D  2020     7.4
4    E  2021     1.9

In [19]:
# 새로운 행 추가
df.loc[5, :] = ['F', 2022, 4.0]
print(df)

  name    year  points
0    A  2017.0     3.5
1    B  2018.0     4.2
2    C  2019.0     2.6
3    D  2020.0     7.4
4    E  2021.0     1.9
5    F  2022.0     4.0

In [21]:
# 범위 선택
print(df[2:4])

  name    year  points
2    C  2019.0     2.6
3    D  2020.0     7.4

In [22]:
#범위 선택, 특정 열
print(df.loc[1:3, 'name'])

1    B
2    C
3    D
Name: name, dtype: object

In [25]:
# DataFrame 데이터 분석 : 데이터 분석과 관련 다양한, 함수 제공
# sum: 행 또는 열의 합
# min, max
# mean
# median
# std, var : 표준편차, 분산
# count
# sort_values : 정렬
# corr, cov : 상관계수, 공분산
data = {'name':['A', 'B', 'C', 'D', 'E'],
       'year':[2017, 2018, 2019, 2020, 2021],
       'points':[3.5, 4.2, 2.6, 7.4, 1.9]}
df = pd.DataFrame(data)

# 각 행의 합
#print(df.sum(axis=1))

# 각 열의 합
print(df.sum(axis=0))

name      ABCDE
year      10095
points     19.6
dtype: object

In [27]:
# pandas에서 dataf frame은 table일 뿐이다.
# File read and load to data frame
# read_csv 함수를 이용하여 cities.csv 파일을 읽고 df으로 로드한다.
# cities.csv 파일에는 2021년 06월 기준, 행정구역별, 성별 인구수가 저장되어 있다.
# https://kosis.kr/statHtml/statHtml.do?orgId=101&tblId=DT_1B040A3&vw_cd=MT_ZTITLE&list_id=A_7&seqNo=&lang_mode=ko&language=kor&obj_var_id=&itm_id=&conn_path=MT_ZTITLE
df = pd.read_csv("cities.csv")

print(df)

# 파일을 저장하는 것도 비슷한 방법으로 한다.
df.to_csv("cities_new.csv")

       행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
0        전국  51672400    4649442    4916548
1     부산광역시   9565990    1647291    1717067
2     대구광역시   2397646    1182380    1215266
3     인천광역시   2936367    1470544    1465823
4     광주광역시   1442647     713793     728854
5     대전광역시   1456107     726666     729441
6     울산광역시   1126369     578924     547445
7   세종특별자치시    362995     181328     181667
8       경기도  13500688    6795088    6705600
9       강원도   1535530     772949     762581
10     충청북도   1597503     810225     787278
11     충청남도   2117400    1082113    1035287
12     전라북도   1794345     892670     901675
13     전라남도   1840921     926398     914523
14     경상북도   2632401    1326844    1305557
15     경상남도   3325840    1674612    1651228
16  제주특별자치도    675293     338766     336527

In [30]:
# Viewing Data Frame
# 파일의 내용을 살펴보자
df.head(7)
# rlqhswjrdmfh 처음 5 라인이 디스플레이 된다.
# df.head(3)은 처음 3개 라인을 디스플레이할 것이다.

    행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
0     전국  51672400    4649442    4916548
1  부산광역시   9565990    1647291    1717067
2  대구광역시   2397646    1182380    1215266
3  인천광역시   2936367    1470544    1465823
4  광주광역시   1442647     713793     728854
5  대전광역시   1456107     726666     729441
6  울산광역시   1126369     578924     547445

In [29]:
df.tail()

       행정구역   총인구수(명)   남자인구수(명)   여자인구수(명)
12     전라북도   1794345     892670     901675
13     전라남도   1840921     926398     914523
14     경상북도   2632401    1326844    1305557
15     경상남도   3325840    1674612    1651228
16  제주특별자치도    675293     338766     336527

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   행정구역       17 non-null     object
 1    총인구수(명)   17 non-null     int64
 2    남자인구수(명)  17 non-null     int64
 3    여자인구수(명)  17 non-null     int64
dtypes: int64(3), object(1)
memory usage: 672.0+ bytes

In [32]:
# df.shape는 행과 열의 수를 빠르게 확인할 수 있다.
df.shape

(17, 4)

In [33]:
df.describe()

            총인구수(명)      남자인구수(명)      여자인구수(명)
count  1.700000e+01  1.700000e+01  1.700000e+01
mean   5.881202e+06  1.515884e+06  1.523669e+06
std    1.227352e+07  1.680130e+06  1.697563e+06
min    3.629950e+05  1.813280e+05  1.816670e+05
25%    1.456107e+06  7.266660e+05  7.294410e+05
50%    1.840921e+06  9.263980e+05  9.145230e+05
75%    2.936367e+06  1.470544e+06  1.465823e+06
max    5.167240e+07  6.795088e+06  6.705600e+06

In [ ]:
#1. 타이타닉 데이터를 df형태로 읽어오세요.
#2. df 출력해보고
#3. head(), tail(), info(), shape, describe

In [35]:
#1. csv파일 데이터를 df로 읽어오기
df = pd.read_csv("titanic.csv")
print(df)

     Unnamed: 0  Survived  Pclass     Sex        Age     Fare Embarked  \
0             0         0       3    male  22.000000   7.2500        S
1             1         1       1  female  38.000000  71.2833        C
2             2         1       3  female  26.000000   7.9250        S
3             3         1       1  female  35.000000  53.1000        S
4             4         0       3    male  35.000000   8.0500        S
..          ...       ...     ...     ...        ...      ...      ...
886         886         0       2    male  27.000000  13.0000        S
887         887         1       1  female  19.000000  30.0000        S
888         888         0       3  female  29.699118  23.4500        S
889         889         1       1    male  26.000000  30.0000        C
890         890         0       3    male  32.000000   7.7500        Q

      Class  Adult_Male   Embarktown
0     Third        True  Southampton
1     First       False    Cherbourg
2     Third       False  Southampton
3     First       False  Southampton
4     Third        True  Southampton
..      ...         ...          ...
886  Second        True  Southampton
887   First       False  Southampton
888   Third       False  Southampton
889   First        True    Cherbourg
890   Third        True   Queenstown

[891 rows x 10 columns]

In [36]:
df.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
0,0,0,3,male,22.0,7.2500,S,Third,True,Southampton
1,1,1,1,female,38.0,71.2833,C,First,False,Cherbourg
2,2,1,3,female,26.0,7.9250,S,Third,False,Southampton
3,3,1,1,female,35.0,53.1000,S,First,False,Southampton
4,4,0,3,male,35.0,8.0500,S,Third,True,Southampton

In [37]:
df.tail()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
886,886,0,2,male,27.000000,13.00,S,Second,True,Southampton
887,887,1,1,female,19.000000,30.00,S,First,False,Southampton
888,888,0,3,female,29.699118,23.45,S,Third,False,Southampton
889,889,1,1,male,26.000000,30.00,C,First,True,Cherbourg
890,890,0,3,male,32.000000,7.75,Q,Third,True,Queenstown

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  891 non-null    int64
 1   Survived    891 non-null    int64
 2   Pclass      891 non-null    int64
 3   Sex         891 non-null    object
 4   Age         891 non-null    float64
 5   Fare        891 non-null    float64
 6   Embarked    889 non-null    object
 7   Class       891 non-null    object
 8   Adult_Male  891 non-null    bool
 9   Embarktown  889 non-null    object
dtypes: bool(1), float64(2), int64(3), object(4)
memory usage: 63.6+ KB

In [39]:
df.shape

(891, 10)

In [40]:
df.describe()

       Unnamed: 0    Survived      Pclass         Age        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean   445.000000    0.383838    2.308642   29.699118   32.204208
std    257.353842    0.486592    0.836071   13.002015   49.693429
min      0.000000    0.000000    1.000000    0.420000    0.000000
25%    222.500000    0.000000    2.000000   22.000000    7.910400
50%    445.000000    0.000000    3.000000   29.699118   14.454200
75%    667.500000    1.000000    3.000000   35.000000   31.000000
max    890.000000    1.000000    3.000000   80.000000  512.329200